Revit 2027 API
RebarConstrainedHandle.IsEdgeHandle Method
 Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEdgeHandle()
Public Function IsEdgeHandle As Boolean
public:
bool IsEdgeHandle()
member IsEdgeHandle : unit -> bool
Return Value
Boolean
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace